Microsoft.Teams.App.KronosWfc/HyperFindRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:hs='http://localhost/wfc/XMLAPISchema'>
  <soapenv:Body>
    <hs:KronosWFC>
      <Kronos_WFC version='1.0'>
        <Request Action ='RunQuery'>
          <HyperFindQuery HyperFindQueryName='All Home' VisibilityCode='Public' QueryDateSpan='5/1/2019 - 5/31/2019'>
          </HyperFindQuery>
        </Request>
      </Kronos_WFC>
    </hs:KronosWFC>
  </soapenv:Body>
</soapenv:Envelope>
